random-benchmark/logs/Qwen2.5-14B-Instruct-1k-gpu2-results.log
Running benchmark with num_prompt=1, random-input-len=1024...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=1, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 1/1 [00:13<00:00, 13.95s/it]
============ Serving Benchmark Result ============
Successful requests:                     1         
Benchmark duration (s):                  13.95     
Total input tokens:                      1024      
Total generated tokens:                  512       
Request throughput (req/s):              0.07      
Output token throughput (tok/s):         36.70     
Total Token throughput (tok/s):          110.09    
---------------Time to First Token----------------
Mean TTFT (ms):                          394.57    
Median TTFT (ms):                        394.57    
P99 TTFT (ms):                           394.57    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          26.53     
Median TPOT (ms):                        26.53     
P99 TPOT (ms):                           26.53     
---------------Inter-token Latency----------------
Mean ITL (ms):                           26.53     
Median ITL (ms):                         26.52     
P99 ITL (ms):                            27.03     
==================================================
Completed benchmark with num_prompt=1, random-input-len=1024.
------------------------------------------------------------
Running benchmark with num_prompt=2, random-input-len=1024...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=2, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 2/2 [00:15<00:00,  7.58s/it]
============ Serving Benchmark Result ============
Successful requests:                     2         
Benchmark duration (s):                  15.16     
Total input tokens:                      2048      
Total generated tokens:                  1024      
Request throughput (req/s):              0.13      
Output token throughput (tok/s):         67.55     
Total Token throughput (tok/s):          202.66    
---------------Time to First Token----------------
Mean TTFT (ms):                          693.83    
Median TTFT (ms):                        693.83    
P99 TTFT (ms):                           693.90    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          28.30     
Median TPOT (ms):                        28.30     
P99 TPOT (ms):                           28.30     
---------------Inter-token Latency----------------
Mean ITL (ms):                           28.30     
Median ITL (ms):                         28.28     
P99 ITL (ms):                            28.90     
==================================================
Completed benchmark with num_prompt=2, random-input-len=1024.
------------------------------------------------------------
Running benchmark with num_prompt=4, random-input-len=1024...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=4, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 4/4 [00:17<00:00,  4.25s/it]
============ Serving Benchmark Result ============
Successful requests:                     4         
Benchmark duration (s):                  17.01     
Total input tokens:                      4096      
Total generated tokens:                  2048      
Request throughput (req/s):              0.24      
Output token throughput (tok/s):         120.41    
Total Token throughput (tok/s):          361.24    
---------------Time to First Token----------------
Mean TTFT (ms):                          1062.05   
Median TTFT (ms):                        1062.10   
P99 TTFT (ms):                           1420.76   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          31.20     
Median TPOT (ms):                        31.20     
P99 TPOT (ms):                           31.91     
---------------Inter-token Latency----------------
Mean ITL (ms):                           31.20     
Median ITL (ms):                         30.48     
P99 ITL (ms):                            31.05     
==================================================
Completed benchmark with num_prompt=4, random-input-len=1024.
------------------------------------------------------------
Running benchmark with num_prompt=6, random-input-len=1024...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=6, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 6/6 [00:19<00:00,  3.18s/it]
============ Serving Benchmark Result ============
Successful requests:                     6         
Benchmark duration (s):                  19.05     
Total input tokens:                      6144      
Total generated tokens:                  3006      
Request throughput (req/s):              0.31      
Output token throughput (tok/s):         157.79    
Total Token throughput (tok/s):          480.31    
---------------Time to First Token----------------
Mean TTFT (ms):                          1430.95   
Median TTFT (ms):                        1418.05   
P99 TTFT (ms):                           2135.34   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          35.33     
Median TPOT (ms):                        35.17     
P99 TPOT (ms):                           39.43     
---------------Inter-token Latency----------------
Mean ITL (ms):                           35.22     
Median ITL (ms):                         33.19     
P99 ITL (ms):                            66.88     
==================================================
Completed benchmark with num_prompt=6, random-input-len=1024.
------------------------------------------------------------
Running benchmark with num_prompt=8, random-input-len=1024...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=8, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 8/8 [00:21<00:00,  2.67s/it]
============ Serving Benchmark Result ============
Successful requests:                     8         
Benchmark duration (s):                  21.40     
Total input tokens:                      8192      
Total generated tokens:                  4095      
Request throughput (req/s):              0.37      
Output token throughput (tok/s):         191.39    
Total Token throughput (tok/s):          574.25    
---------------Time to First Token----------------
Mean TTFT (ms):                          1772.23   
Median TTFT (ms):                        1772.84   
P99 TTFT (ms):                           2828.95   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          38.41     
Median TPOT (ms):                        38.40     
P99 TPOT (ms):                           40.47     
---------------Inter-token Latency----------------
Mean ITL (ms):                           38.41     
Median ITL (ms):                         36.21     
P99 ITL (ms):                            37.34     
==================================================
Completed benchmark with num_prompt=8, random-input-len=1024.
------------------------------------------------------------
Running benchmark with num_prompt=10, random-input-len=1024...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=10, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 10/10 [00:20<00:00,  2.06s/it]
============ Serving Benchmark Result ============
Successful requests:                     10        
Benchmark duration (s):                  20.63     
Total input tokens:                      10240     
Total generated tokens:                  5118      
Request throughput (req/s):              0.48      
Output token throughput (tok/s):         248.10    
Total Token throughput (tok/s):          744.48    
---------------Time to First Token----------------
Mean TTFT (ms):                          2131.26   
Median TTFT (ms):                        2125.00   
P99 TTFT (ms):                           3528.59   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          36.21     
Median TPOT (ms):                        36.24     
P99 TPOT (ms):                           38.89     
---------------Inter-token Latency----------------
Mean ITL (ms):                           36.19     
Median ITL (ms):                         33.45     
P99 ITL (ms):                            34.49     
==================================================
Completed benchmark with num_prompt=10, random-input-len=1024.
------------------------------------------------------------
Running benchmark with num_prompt=12, random-input-len=1024...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=12, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 12/12 [00:21<00:00,  1.83s/it]
============ Serving Benchmark Result ============
Successful requests:                     12        
Benchmark duration (s):                  21.92     
Total input tokens:                      12288     
Total generated tokens:                  6143      
Request throughput (req/s):              0.55      
Output token throughput (tok/s):         280.27    
Total Token throughput (tok/s):          840.90    
---------------Time to First Token----------------
Mean TTFT (ms):                          2499.37   
Median TTFT (ms):                        2490.30   
P99 TTFT (ms):                           4280.04   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          38.00     
Median TPOT (ms):                        38.02     
P99 TPOT (ms):                           41.47     
---------------Inter-token Latency----------------
Mean ITL (ms):                           38.05     
Median ITL (ms):                         34.60     
P99 ITL (ms):                            35.57     
==================================================
Completed benchmark with num_prompt=12, random-input-len=1024.
------------------------------------------------------------
Running benchmark with num_prompt=14, random-input-len=1024...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=14, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 14/14 [00:23<00:00,  1.67s/it]
============ Serving Benchmark Result ============
Successful requests:                     14        
Benchmark duration (s):                  23.35     
Total input tokens:                      14336     
Total generated tokens:                  7165      
Request throughput (req/s):              0.60      
Output token throughput (tok/s):         306.80    
Total Token throughput (tok/s):          920.65    
---------------Time to First Token----------------
Mean TTFT (ms):                          2859.84   
Median TTFT (ms):                        2849.55   
P99 TTFT (ms):                           5058.03   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          40.12     
Median TPOT (ms):                        40.12     
P99 TPOT (ms):                           44.28     
---------------Inter-token Latency----------------
Mean ITL (ms):                           40.13     
Median ITL (ms):                         35.87     
P99 ITL (ms):                            37.22     
==================================================
Completed benchmark with num_prompt=14, random-input-len=1024.
------------------------------------------------------------
Running benchmark with num_prompt=16, random-input-len=1024...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=16, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 16/16 [00:24<00:00,  1.55s/it]
============ Serving Benchmark Result ============
Successful requests:                     16        
Benchmark duration (s):                  24.72     
Total input tokens:                      16384     
Total generated tokens:                  8190      
Request throughput (req/s):              0.65      
Output token throughput (tok/s):         331.26    
Total Token throughput (tok/s):          993.93    
---------------Time to First Token----------------
Mean TTFT (ms):                          3307.30   
Median TTFT (ms):                        3213.50   
P99 TTFT (ms):                           5781.65   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          41.92     
Median TPOT (ms):                        42.09     
P99 TPOT (ms):                           46.94     
---------------Inter-token Latency----------------
Mean ITL (ms):                           42.01     
Median ITL (ms):                         37.24     
P99 ITL (ms):                            38.63     
==================================================
Completed benchmark with num_prompt=16, random-input-len=1024.
------------------------------------------------------------
Running benchmark with num_prompt=18, random-input-len=1024...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=18, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 18/18 [00:32<00:00,  1.79s/it]
============ Serving Benchmark Result ============
Successful requests:                     18        
Benchmark duration (s):                  32.21     
Total input tokens:                      18432     
Total generated tokens:                  9210      
Request throughput (req/s):              0.56      
Output token throughput (tok/s):         285.96    
Total Token throughput (tok/s):          858.24    
---------------Time to First Token----------------
Mean TTFT (ms):                          3842.19   
Median TTFT (ms):                        3975.80   
P99 TTFT (ms):                           6465.36   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          55.54     
Median TPOT (ms):                        55.35     
P99 TPOT (ms):                           61.51     
---------------Inter-token Latency----------------
Mean ITL (ms):                           56.23     
Median ITL (ms):                         50.48     
P99 ITL (ms):                            98.99     
==================================================
Completed benchmark with num_prompt=18, random-input-len=1024.
------------------------------------------------------------
Running benchmark with num_prompt=20, random-input-len=1024...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=20, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 20/20 [00:33<00:00,  1.68s/it]
============ Serving Benchmark Result ============
Successful requests:                     20        
Benchmark duration (s):                  33.58     
Total input tokens:                      20480     
Total generated tokens:                  10226     
Request throughput (req/s):              0.60      
Output token throughput (tok/s):         304.55    
Total Token throughput (tok/s):          914.49    
---------------Time to First Token----------------
Mean TTFT (ms):                          4234.53   
Median TTFT (ms):                        4341.95   
P99 TTFT (ms):                           7218.48   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          57.50     
Median TPOT (ms):                        57.26     
P99 TPOT (ms):                           64.17     
---------------Inter-token Latency----------------
Mean ITL (ms):                           58.40     
Median ITL (ms):                         51.68     
P99 ITL (ms):                            103.87    
==================================================
Completed benchmark with num_prompt=20, random-input-len=1024.
------------------------------------------------------------
Running benchmark with num_prompt=22, random-input-len=1024...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=22, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 22/22 [00:35<00:00,  1.61s/it]
============ Serving Benchmark Result ============
Successful requests:                     22        
Benchmark duration (s):                  35.34     
Total input tokens:                      22528     
Total generated tokens:                  11249     
Request throughput (req/s):              0.62      
Output token throughput (tok/s):         318.34    
Total Token throughput (tok/s):          955.88    
---------------Time to First Token----------------
Mean TTFT (ms):                          4553.34   
Median TTFT (ms):                        4681.37   
P99 TTFT (ms):                           7977.43   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          60.31     
Median TPOT (ms):                        60.16     
P99 TPOT (ms):                           67.67     
---------------Inter-token Latency----------------
Mean ITL (ms):                           61.16     
Median ITL (ms):                         53.39     
P99 ITL (ms):                            108.30    
==================================================
Completed benchmark with num_prompt=22, random-input-len=1024.
------------------------------------------------------------
Running benchmark with num_prompt=24, random-input-len=1024...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=24, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 24/24 [00:36<00:00,  1.52s/it]
============ Serving Benchmark Result ============
Successful requests:                     24        
Benchmark duration (s):                  36.42     
Total input tokens:                      24576     
Total generated tokens:                  12272     
Request throughput (req/s):              0.66      
Output token throughput (tok/s):         337.00    
Total Token throughput (tok/s):          1011.88   
---------------Time to First Token----------------
Mean TTFT (ms):                          4936.81   
Median TTFT (ms):                        5043.07   
P99 TTFT (ms):                           8677.06   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          61.67     
Median TPOT (ms):                        61.45     
P99 TPOT (ms):                           69.70     
---------------Inter-token Latency----------------
Mean ITL (ms):                           62.33     
Median ITL (ms):                         54.44     
P99 ITL (ms):                            105.99    
==================================================
Completed benchmark with num_prompt=24, random-input-len=1024.
------------------------------------------------------------